import styles from "./CodeOfConductText.module.css";

export default function CodeOfConductText() {
  return (
    <section>
      <div className={styles.CodeOfConductTextSectionContainer}>
        <h1>مرام نامه</h1>
        <div className={"bodyText"}>
          پایکون ایران یک کنفرانس انجمنی است که برای شبکه‌سازی و همکاری در جامعه
          توسعه‌دهندگان در نظر گرفته شده است.
        </div>
        <div className={"bodyText"}>
          ما برای مشارکت هر یک از اعضا ارزش قائل هستیم و به فراگیری، مهربانی و
          یک جامعه مثبت برای همه معتقدیم.
        </div>
        <div className={"bodyText"}>
          ما از همه کارکنان، شرکت‌کنندگان، سخنرانان، غرفه‌داران، سازمان‌دهندگان،
          اسپانسرها و داوطلبان پایکون ایران انتظار داریم که همیشه به شیوه‌ای
          حرفه‌ای و محترمانه عمل کنند. این یعنی:
        </div>
        <h3>انجام دهید:</h3>
        <ul className={"bodyText"} style={{ backgroundColor: "#d6f1d396" }}>
          <li>پذیرای همکاری باشید</li>
          <li>از زبان خوشامدگویی و مثبت استفاده کنید</li>
          <li>
            به نظرات و تجربیات دیگران احترام بگذارید، خواه آن‌ها با شما همسو
            باشند یا نباشند
          </li>
          <li>نسبت به سایر اعضای انجمن همدلی نشان دهید</li>
          <li>در فضاهای عمومی و خصوصی به دیگران احترام بگذارید</li>
        </ul>
        <h3>انجام ندهید:</h3>
        <ul className={"bodyText"} style={{ backgroundColor: "#ffeaeb83" }}>
          <li>کج خلقی و ترش رویی کردن</li>
          <li>حملات شخصی یا سیاسی انجام دادن</li>
          <li>آزار و اذیت شخص دیگری، چه به صورت علنی یا خصوصی به هر شکلی</li>
          <li>
            از زبان جنسی استفاده کردن یا رفتارهای جنسی/غیرجنسی ناخوش آیند انجام
            دادن
          </li>
          <li>
            از اموال شخص دیگری اعم از فیزیکی یا الکترونیکی بدون اجازه صریح او
            استفاده کردن
          </li>
          <li>
            انجام هر گونه اقدام دیگری که برای یک مخاطب حرفه‌ای شامل افراد با
            پیشینه‌های مختلف نامناسب است
          </li>
        </ul>
        <h3>استانداردهای ما</h3>
        <div className={"bodyText"}>
          هر عضو جامعه ما حق دارد که به هویت‌اش احترام گذاشته‌شود. پایکون ایران
          به ارایه یک تجربه‌ی مثبت برای همه صرف نظر از سن، هویت جنسی و قیافه،
          گرایش جنسی، ناتوانی، ظاهر فیزیکی، اندازه بدن، قومیت، ملیت، نژاد یا
          مذهب، تحصیلات، مکان، انتخاب فناوری، شغل یا وضعیت اجتماعی-اقتصادی
          اختصاص داده شده است.
        </div>
        <h3>رویدادهای آنلاین</h3>
        <div className={"bodyText"}>
          مرام نامه در مورد تعاملات با حساب‌های رسمی رویداد در فضاهای اجتماعی و
          برنامه‌های تلفن همراه اعمال می‌شود، از جمله:
        </div>
        <ul className={"bodyText"}>
          <li>نظرات ارایه شده در برنامه‌های تلفن همراه کنفرانس رسمی</li>
          <li>نظرات ارایه شده در پلتفرم میزبانی ویدیوی رویداد</li>
          <li>نظرات ارایه شده در مورد هشتگ رسمی رویداد یا هشتگ‌های پنل</li>
        </ul>
        <div className={"bodyText"}>
          سازمان‌دهندگان رویداد این مرام نامه را در طول رویداد اجرا می‌کنند.
        </div>
        <h3>عواقب</h3>
        <div className={"bodyText"}>
          اگر شرکت‌کننده‌ای رفتار آزاردهنده‌ای داشته باشد، سازمان‌دهندگان
          کنفرانس ممکن است هر اقدامی را که مناسب می‌دانند، از جمله هشدار دادن به
          متخلف یا اخراج از هر پلتفرم خصوصی، کنفرانس آنلاین، انجمن و رویدادهای
          انجمن بدون بازپرداخت بلیط رویداد انجام دهند. با تشکر از شما برای کمک
          به ایجاد این یک جامعه دوستانه و خوش آیند برای همه.
        </div>
        <div className={"bodyText"}>
          ما از شرکت کنندگان انتظار داریم که این قوانین را در تمام پلتفرم‌های
          کنفرانس رعایت کنند.
        </div>
        <h3>استنادها</h3>
        <div className={"bodyText"}>
          زبان بکار گرفته شده در مرام نامه‌های زیر در این نگارش استفاده شده است:
        </div>
        <ul className={"bodyText"}>
          <li>
            مرام نامه‌ی PSF توسط بنیاد نرم افزار پایتون که تحت مجوز Creative
            Commons Attribution 3.0 Unported است.
          </li>
          <li>مرام نامه‌ی Next.js Conf</li>
        </ul>
        <h3>مجوز</h3>
        <div className={"bodyText"}>
          این مرام نامه تحت مجوز Creative Commons Attribution 3.0 Unported است.
        </div>
      </div>
    </section>
  );
}
